In [ ]:
import pandas as pd

In [ ]:
test_df = pd.read_csv("test.csv")
test_df.head()

In [ ]:
train_df = pd.read_csv("train.csv")
train_df.head()

In [ ]:
print("Test Shape : ", test_df.shape)
print("Train Shape : ", train_df.shape)

In [ ]:
train_df["BldgType"].value_counts()

In [ ]:

for i in train_df.columns:
    if train_df[i].isnull().sum()>0:
        print(i ,":", train_df[i].isnull().sum())

In [ ]:
def print_missing_value(df):
    for i in df.columns:
        if df[i].isnull().sum()>0:
            print(i ,":", df[i].isnull().sum())

In [ ]:
# print_missing_value(test_df)
print_missing_value(train_df)

In [ ]:
a = ["a","b","c","d"]
b = [[1,2,3,4]]

ab = pd.DataFrame(b,columns=a)

In [ ]:
def print_object_dtype(df):
    
    object_type = []
    try:
        for i in train_df.columns:
            if train_df[i].dtype=="O":
                object_type.append(i)
    
        return object_type
    except Exception as e:
        return f"Error Occured",e

In [ ]:

def print_numerical_dtype(df):
    numerical_type = []
    try:
        for i in df.columns:
            if df[i].dtype=="O":
                pass
            else:
                numerical_type.append(i)
        return numerical_type
    except Exception as e:
        return f"Error Occured",e

In [ ]:
print_object_dtype(train_df)

In [ ]:
print_numerical_dtype(train_df)

# 28/07/2023

In [4]:
import pandas as pd
scores = { 
    'St1' :{'MCQ':80,"Coding":75,"Interview":80},
    'St2' :{'MCQ':70,"Coding":55,"Interview":60},
    'St3' :{'MCQ':90,"Coding":65,"Interview":90},
}

score_s = pd.Series(scores)
score_s

St1    {'MCQ': 80, 'Coding': 75, 'Interview': 80}
St2    {'MCQ': 70, 'Coding': 55, 'Interview': 60}
St3    {'MCQ': 90, 'Coding': 65, 'Interview': 90}
dtype: object

In [5]:
total_s = score_s.apply(lambda x : sum(x.values()))

In [6]:
total_s

St1    235
St2    185
St3    245
dtype: int64

## DataFrame

In [17]:
store = {
    'p_id' : [1,2,3,4,5,6],
    'p_name' :['fan','pan','clock',"knief",'pen','table'],
    'q_sold' : [30,100,2,30,40,21],
    'price' : [1000,200,3000,10,40,30]
}

In [18]:
s_df = pd.DataFrame(store)
s_df

   p_id p_name  q_sold  price
0     1    fan      30   1000
1     2    pan     100    200
2     3  clock       2   3000
3     4  knief      30     10
4     5    pen      40     40
5     6  table      21     30

In [19]:
s_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   p_id    6 non-null      int64
 1   p_name  6 non-null      object
 2   q_sold  6 non-null      int64
 3   price   6 non-null      int64
dtypes: int64(3), object(1)
memory usage: 320.0+ bytes

In [24]:
s_df.head(3)

   p_id p_name  q_sold  price
0     1    fan      30   1000
1     2    pan     100    200
2     3  clock       2   3000

In [25]:
s_df.tail(3)

   p_id p_name  q_sold  price
3     4  knief      30     10
4     5    pen      40     40
5     6  table      21     30

In [29]:
s_df['p_name'].value_counts()

fan      1
pan      1
clock    1
knief    1
pen      1
table    1
Name: p_name, dtype: int64

In [30]:
s_df["Total_sale"] = s_df["q_sold"]*s_df["price"]

In [31]:
s_df

   p_id p_name  q_sold  price  Total_sale
0     1    fan      30   1000       30000
1     2    pan     100    200       20000
2     3  clock       2   3000        6000
3     4  knief      30     10         300
4     5    pen      40     40        1600
5     6  table      21     30         630

In [33]:
s_df[["p_id","Total_sale"]]

   p_id  Total_sale
0     1       30000
1     2       20000
2     3        6000
3     4         300
4     5        1600
5     6         630

In [35]:
s_df[s_df["q_sold"]<10]

   p_id p_name  q_sold  price  Total_sale
2     3  clock       2   3000        6000

In [37]:
s_df[s_df["q_sold"]>30]

   p_id p_name  q_sold  price  Total_sale
1     2    pan     100    200       20000
4     5    pen      40     40        1600

In [44]:
# Sorting Ascending by Total_sale
s_df.sort_values(by=  "Total_sale")

   p_id p_name  q_sold  price  Total_sale
3     4  knief      30     10         300
5     6  table      21     30         630
4     5    pen      40     40        1600
2     3  clock       2   3000        6000
1     2    pan     100    200       20000
0     1    fan      30   1000       30000

In [46]:
# Sorting descending by Total_sale
s_df.sort_values(by=  "Total_sale", ascending=False)

   p_id p_name  q_sold  price  Total_sale
0     1    fan      30   1000       30000
1     2    pan     100    200       20000
2     3  clock       2   3000        6000
4     5    pen      40     40        1600
5     6  table      21     30         630
3     4  knief      30     10         300

In [47]:
s_df.describe()

           p_id      q_sold        price    Total_sale
count  6.000000    6.000000     6.000000      6.000000
mean   3.500000   37.166667   713.333333   9755.000000
std    1.870829   33.337166  1182.331031  12394.246649
min    1.000000    2.000000    10.000000    300.000000
25%    2.250000   23.250000    32.500000    872.500000
50%    3.500000   30.000000   120.000000   3800.000000
75%    4.750000   37.500000   800.000000  16500.000000
max    6.000000  100.000000  3000.000000  30000.000000

In [49]:
s_df.axes

[RangeIndex(start=0, stop=6, step=1),
 Index(['p_id', 'p_name', 'q_sold', 'price', 'Total_sale'], dtype='object')]

In [ ]:
s_df

In [2]:
len(["hello",2, 4, 6])

4

In [3]:
X = 2+9*((3*12)-8)/10
X

27.2